FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_LM3S316_IAR/hw_include/hw_nvic.h
/****************************************************************************** */
/* */
/* hw_nvic.h - Macros used when accessing the NVIC hardware. */
/* */
/* Copyright (c) 2005,2006 Luminary Micro, Inc.  All rights reserved. */
/* */
/* Software License Agreement */
/* */
/* Luminary Micro, Inc. (LMI) is supplying this software for use solely and */
/* exclusively on LMI's Stellaris Family of microcontroller products. */
/* */
/* The software is owned by LMI and/or its suppliers, and is protected under */
/* applicable copyright laws.  All rights are reserved.  Any use in violation */
/* of the foregoing restrictions may subject the user to criminal sanctions */
/* under applicable laws, as well as to civil liability for the breach of the */
/* terms and conditions of this license. */
/* */
/* THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED */
/* OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF */
/* MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. */
/* LMI SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR */
/* CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER. */
/* */
/* This is part of revision 635 of the Stellaris Driver Library. */
/* */
/****************************************************************************** */

#ifndef __HW_NVIC_H__
#define __HW_NVIC_H__

/****************************************************************************** */
/* */
/* The following define the addresses of the NVIC registers. */
/* */
/****************************************************************************** */
#define NVIC_INT_TYPE        0xE000E004     /* Interrupt Controller Type Reg. */
#define NVIC_ST_CTRL         0xE000E010     /* SysTick Control and Status Reg. */
#define NVIC_ST_RELOAD       0xE000E014     /* SysTick Reload Value Register */
#define NVIC_ST_CURRENT      0xE000E018     /* SysTick Current Value Register */
#define NVIC_ST_CAL          0xE000E01C     /* SysTick Calibration Value Reg. */
#define NVIC_EN0             0xE000E100     /* IRQ 0 to 31 Set Enable Register */
#define NVIC_DIS0            0xE000E180     /* IRQ 0 to 31 Clear Enable Reg. */
#define NVIC_PEND0           0xE000E200     /* IRQ 0 to 31 Set Pending Register */
#define NVIC_UNPEND0         0xE000E280     /* IRQ 0 to 31 Clear Pending Reg. */
#define NVIC_ACTIVE0         0xE000E300     /* IRQ 0 to 31 Active Register */
#define NVIC_PRI0            0xE000E400     /* IRQ 0 to 3 Priority Register */
#define NVIC_PRI1            0xE000E404     /* IRQ 4 to 7 Priority Register */
#define NVIC_PRI2            0xE000E408     /* IRQ 8 to 11 Priority Register */
#define NVIC_PRI3            0xE000E40C     /* IRQ 12 to 15 Priority Register */
#define NVIC_PRI4            0xE000E410     /* IRQ 16 to 19 Priority Register */
#define NVIC_PRI5            0xE000E414     /* IRQ 20 to 23 Priority Register */
#define NVIC_PRI6            0xE000E418     /* IRQ 24 to 27 Priority Register */
#define NVIC_PRI7            0xE000E41C     /* IRQ 28 to 31 Priority Register */
#define NVIC_CPUID           0xE000ED00     /* CPUID Base Register */
#define NVIC_INT_CTRL        0xE000ED04     /* Interrupt Control State Register */
#define NVIC_VTABLE          0xE000ED08     /* Vector Table Offset Register */
#define NVIC_APINT           0xE000ED0C     /* App. Int & Reset Control Reg. */
#define NVIC_SYS_CTRL        0xE000ED10     /* System Control Register */
#define NVIC_CFG_CTRL        0xE000ED14     /* Configuration Control Register */
#define NVIC_SYS_PRI1        0xE000ED18     /* Sys. Handlers 4 to 7 Priority */
#define NVIC_SYS_PRI2        0xE000ED1C     /* Sys. Handlers 8 to 11 Priority */
#define NVIC_SYS_PRI3        0xE000ED20     /* Sys. Handlers 12 to 15 Priority */
#define NVIC_SYS_HND_CTRL    0xE000ED24     /* System Handler Control and State */
#define NVIC_FAULT_STAT      0xE000ED28     /* Configurable Fault Status Reg. */
#define NVIC_HFAULT_STAT     0xE000ED2C     /* Hard Fault Status Register */
#define NVIC_DEBUG_STAT      0xE000ED30     /* Debug Status Register */
#define NVIC_MM_ADDR         0xE000ED34     /* Mem Manage Address Register */
#define NVIC_FAULT_ADDR      0xE000ED38     /* Bus Fault Address Register */
#define NVIC_MPU_TYPE        0xE000ED90     /* MPU Type Register */
#define NVIC_MPU_CTRL        0xE000ED94     /* MPU Control Register */
#define NVIC_MPU_NUMBER      0xE000ED98     /* MPU Region Number Register */
#define NVIC_MPU_BASE        0xE000ED9C     /* MPU Region Base Address Register */
#define NVIC_MPU_ATTR        0xE000EDA0     /* MPU Region Attribute & Size Reg. */
#define NVIC_DBG_CTRL        0xE000EDF0     /* Debug Control and Status Reg. */
#define NVIC_DBG_XFER        0xE000EDF4     /* Debug Core Reg. Transfer Select */
#define NVIC_DBG_DATA        0xE000EDF8     /* Debug Core Register Data */
#define NVIC_DBG_INT         0xE000EDFC     /* Debug Reset Interrupt Control */
#define NVIC_SW_TRIG         0xE000EF00     /* Software Trigger Interrupt Reg. */

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_INT_TYPE register. */
/* */
/****************************************************************************** */
#define NVIC_INT_TYPE_LINES_M    0x0000001F /* Number of interrupt lines (x32) */
#define NVIC_INT_TYPE_LINES_S    0

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_ST_CTRL register. */
/* */
/****************************************************************************** */
#define NVIC_ST_CTRL_COUNT      0x00010000  /* Count flag */
#define NVIC_ST_CTRL_CLK_SRC    0x00000004  /* Clock Source */
#define NVIC_ST_CTRL_INTEN      0x00000002  /* Interrupt enable */
#define NVIC_ST_CTRL_ENABLE     0x00000001  /* Counter mode */

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_ST_RELOAD register. */
/* */
/****************************************************************************** */
#define NVIC_ST_RELOAD_M    0x00FFFFFF      /* Counter load value */
#define NVIC_ST_RELOAD_S    0

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_ST_CURRENT register. */
/* */
/****************************************************************************** */
#define NVIC_ST_CURRENT_M    0x00FFFFFF     /* Counter current value */
#define NVIC_ST_CURRENT_S    0

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_ST_CAL register. */
/* */
/****************************************************************************** */
#define NVIC_ST_CAL_NOREF      0x80000000   /* No reference clock */
#define NVIC_ST_CAL_SKEW       0x40000000   /* Clock skew */
#define NVIC_ST_CAL_ONEMS_M    0x00FFFFFF   /* 1ms reference value */
#define NVIC_ST_CAL_ONEMS_S    0

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_EN0 register. */
/* */
/****************************************************************************** */
#define NVIC_EN0_INT31    0x80000000        /* Interrupt 31 enable */
#define NVIC_EN0_INT30    0x40000000        /* Interrupt 30 enable */
#define NVIC_EN0_INT29    0x20000000        /* Interrupt 29 enable */
#define NVIC_EN0_INT28    0x10000000        /* Interrupt 28 enable */
#define NVIC_EN0_INT27    0x08000000        /* Interrupt 27 enable */
#define NVIC_EN0_INT26    0x04000000        /* Interrupt 26 enable */
#define NVIC_EN0_INT25    0x02000000        /* Interrupt 25 enable */
#define NVIC_EN0_INT24    0x01000000        /* Interrupt 24 enable */
#define NVIC_EN0_INT23    0x00800000        /* Interrupt 23 enable */
#define NVIC_EN0_INT22    0x00400000        /* Interrupt 22 enable */
#define NVIC_EN0_INT21    0x00200000        /* Interrupt 21 enable */
#define NVIC_EN0_INT20    0x00100000        /* Interrupt 20 enable */
#define NVIC_EN0_INT19    0x00080000        /* Interrupt 19 enable */
#define NVIC_EN0_INT18    0x00040000        /* Interrupt 18 enable */
#define NVIC_EN0_INT17    0x00020000        /* Interrupt 17 enable */
#define NVIC_EN0_INT16    0x00010000        /* Interrupt 16 enable */
#define NVIC_EN0_INT15    0x00008000        /* Interrupt 15 enable */
#define NVIC_EN0_INT14    0x00004000        /* Interrupt 14 enable */
#define NVIC_EN0_INT13    0x00002000        /* Interrupt 13 enable */
#define NVIC_EN0_INT12    0x00001000        /* Interrupt 12 enable */
#define NVIC_EN0_INT11    0x00000800        /* Interrupt 11 enable */
#define NVIC_EN0_INT10    0x00000400        /* Interrupt 10 enable */
#define NVIC_EN0_INT9     0x00000200        /* Interrupt 9 enable */
#define NVIC_EN0_INT8     0x00000100        /* Interrupt 8 enable */
#define NVIC_EN0_INT7     0x00000080        /* Interrupt 7 enable */
#define NVIC_EN0_INT6     0x00000040        /* Interrupt 6 enable */
#define NVIC_EN0_INT5     0x00000020        /* Interrupt 5 enable */
#define NVIC_EN0_INT4     0x00000010        /* Interrupt 4 enable */
#define NVIC_EN0_INT3     0x00000008        /* Interrupt 3 enable */
#define NVIC_EN0_INT2     0x00000004        /* Interrupt 2 enable */
#define NVIC_EN0_INT1     0x00000002        /* Interrupt 1 enable */
#define NVIC_EN0_INT0     0x00000001        /* Interrupt 0 enable */

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_DIS0 register. */
/* */
/****************************************************************************** */
#define NVIC_DIS0_INT31    0x80000000       /* Interrupt 31 disable */
#define NVIC_DIS0_INT30    0x40000000       /* Interrupt 30 disable */
#define NVIC_DIS0_INT29    0x20000000       /* Interrupt 29 disable */
#define NVIC_DIS0_INT28    0x10000000       /* Interrupt 28 disable */
#define NVIC_DIS0_INT27    0x08000000       /* Interrupt 27 disable */
#define NVIC_DIS0_INT26    0x04000000       /* Interrupt 26 disable */
#define NVIC_DIS0_INT25    0x02000000       /* Interrupt 25 disable */
#define NVIC_DIS0_INT24    0x01000000       /* Interrupt 24 disable */
#define NVIC_DIS0_INT23    0x00800000       /* Interrupt 23 disable */
#define NVIC_DIS0_INT22    0x00400000       /* Interrupt 22 disable */
#define NVIC_DIS0_INT21    0x00200000       /* Interrupt 21 disable */
#define NVIC_DIS0_INT20    0x00100000       /* Interrupt 20 disable */
#define NVIC_DIS0_INT19    0x00080000       /* Interrupt 19 disable */
#define NVIC_DIS0_INT18    0x00040000       /* Interrupt 18 disable */
#define NVIC_DIS0_INT17    0x00020000       /* Interrupt 17 disable */
#define NVIC_DIS0_INT16    0x00010000       /* Interrupt 16 disable */
#define NVIC_DIS0_INT15    0x00008000       /* Interrupt 15 disable */
#define NVIC_DIS0_INT14    0x00004000       /* Interrupt 14 disable */
#define NVIC_DIS0_INT13    0x00002000       /* Interrupt 13 disable */
#define NVIC_DIS0_INT12    0x00001000       /* Interrupt 12 disable */
#define NVIC_DIS0_INT11    0x00000800       /* Interrupt 11 disable */
#define NVIC_DIS0_INT10    0x00000400       /* Interrupt 10 disable */
#define NVIC_DIS0_INT9     0x00000200       /* Interrupt 9 disable */
#define NVIC_DIS0_INT8     0x00000100       /* Interrupt 8 disable */
#define NVIC_DIS0_INT7     0x00000080       /* Interrupt 7 disable */
#define NVIC_DIS0_INT6     0x00000040       /* Interrupt 6 disable */
#define NVIC_DIS0_INT5     0x00000020       /* Interrupt 5 disable */
#define NVIC_DIS0_INT4     0x00000010       /* Interrupt 4 disable */
#define NVIC_DIS0_INT3     0x00000008       /* Interrupt 3 disable */
#define NVIC_DIS0_INT2     0x00000004       /* Interrupt 2 disable */
#define NVIC_DIS0_INT1     0x00000002       /* Interrupt 1 disable */
#define NVIC_DIS0_INT0     0x00000001       /* Interrupt 0 disable */

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_PEND0 register. */
/* */
/****************************************************************************** */
#define NVIC_PEND0_INT31    0x80000000      /* Interrupt 31 pend */
#define NVIC_PEND0_INT30    0x40000000      /* Interrupt 30 pend */
#define NVIC_PEND0_INT29    0x20000000      /* Interrupt 29 pend */
#define NVIC_PEND0_INT28    0x10000000      /* Interrupt 28 pend */
#define NVIC_PEND0_INT27    0x08000000      /* Interrupt 27 pend */
#define NVIC_PEND0_INT26    0x04000000      /* Interrupt 26 pend */
#define NVIC_PEND0_INT25    0x02000000      /* Interrupt 25 pend */
#define NVIC_PEND0_INT24    0x01000000      /* Interrupt 24 pend */
#define NVIC_PEND0_INT23    0x00800000      /* Interrupt 23 pend */
#define NVIC_PEND0_INT22    0x00400000      /* Interrupt 22 pend */
#define NVIC_PEND0_INT21    0x00200000      /* Interrupt 21 pend */
#define NVIC_PEND0_INT20    0x00100000      /* Interrupt 20 pend */
#define NVIC_PEND0_INT19    0x00080000      /* Interrupt 19 pend */
#define NVIC_PEND0_INT18    0x00040000      /* Interrupt 18 pend */
#define NVIC_PEND0_INT17    0x00020000      /* Interrupt 17 pend */
#define NVIC_PEND0_INT16    0x00010000      /* Interrupt 16 pend */
#define NVIC_PEND0_INT15    0x00008000      /* Interrupt 15 pend */
#define NVIC_PEND0_INT14    0x00004000      /* Interrupt 14 pend */
#define NVIC_PEND0_INT13    0x00002000      /* Interrupt 13 pend */
#define NVIC_PEND0_INT12    0x00001000      /* Interrupt 12 pend */
#define NVIC_PEND0_INT11    0x00000800      /* Interrupt 11 pend */
#define NVIC_PEND0_INT10    0x00000400      /* Interrupt 10 pend */
#define NVIC_PEND0_INT9     0x00000200      /* Interrupt 9 pend */
#define NVIC_PEND0_INT8     0x00000100      /* Interrupt 8 pend */
#define NVIC_PEND0_INT7     0x00000080      /* Interrupt 7 pend */
#define NVIC_PEND0_INT6     0x00000040      /* Interrupt 6 pend */
#define NVIC_PEND0_INT5     0x00000020      /* Interrupt 5 pend */
#define NVIC_PEND0_INT4     0x00000010      /* Interrupt 4 pend */
#define NVIC_PEND0_INT3     0x00000008      /* Interrupt 3 pend */
#define NVIC_PEND0_INT2     0x00000004      /* Interrupt 2 pend */
#define NVIC_PEND0_INT1     0x00000002      /* Interrupt 1 pend */
#define NVIC_PEND0_INT0     0x00000001      /* Interrupt 0 pend */

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_UNPEND0 register. */
/* */
/****************************************************************************** */
#define NVIC_UNPEND0_INT31    0x80000000    /* Interrupt 31 unpend */
#define NVIC_UNPEND0_INT30    0x40000000    /* Interrupt 30 unpend */
#define NVIC_UNPEND0_INT29    0x20000000    /* Interrupt 29 unpend */
#define NVIC_UNPEND0_INT28    0x10000000    /* Interrupt 28 unpend */
#define NVIC_UNPEND0_INT27    0x08000000    /* Interrupt 27 unpend */
#define NVIC_UNPEND0_INT26    0x04000000    /* Interrupt 26 unpend */
#define NVIC_UNPEND0_INT25    0x02000000    /* Interrupt 25 unpend */
#define NVIC_UNPEND0_INT24    0x01000000    /* Interrupt 24 unpend */
#define NVIC_UNPEND0_INT23    0x00800000    /* Interrupt 23 unpend */
#define NVIC_UNPEND0_INT22    0x00400000    /* Interrupt 22 unpend */
#define NVIC_UNPEND0_INT21    0x00200000    /* Interrupt 21 unpend */
#define NVIC_UNPEND0_INT20    0x00100000    /* Interrupt 20 unpend */
#define NVIC_UNPEND0_INT19    0x00080000    /* Interrupt 19 unpend */
#define NVIC_UNPEND0_INT18    0x00040000    /* Interrupt 18 unpend */
#define NVIC_UNPEND0_INT17    0x00020000    /* Interrupt 17 unpend */
#define NVIC_UNPEND0_INT16    0x00010000    /* Interrupt 16 unpend */
#define NVIC_UNPEND0_INT15    0x00008000    /* Interrupt 15 unpend */
#define NVIC_UNPEND0_INT14    0x00004000    /* Interrupt 14 unpend */
#define NVIC_UNPEND0_INT13    0x00002000    /* Interrupt 13 unpend */
#define NVIC_UNPEND0_INT12    0x00001000    /* Interrupt 12 unpend */
#define NVIC_UNPEND0_INT11    0x00000800    /* Interrupt 11 unpend */
#define NVIC_UNPEND0_INT10    0x00000400    /* Interrupt 10 unpend */
#define NVIC_UNPEND0_INT9     0x00000200    /* Interrupt 9 unpend */
#define NVIC_UNPEND0_INT8     0x00000100    /* Interrupt 8 unpend */
#define NVIC_UNPEND0_INT7     0x00000080    /* Interrupt 7 unpend */
#define NVIC_UNPEND0_INT6     0x00000040    /* Interrupt 6 unpend */
#define NVIC_UNPEND0_INT5     0x00000020    /* Interrupt 5 unpend */
#define NVIC_UNPEND0_INT4     0x00000010    /* Interrupt 4 unpend */
#define NVIC_UNPEND0_INT3     0x00000008    /* Interrupt 3 unpend */
#define NVIC_UNPEND0_INT2     0x00000004    /* Interrupt 2 unpend */
#define NVIC_UNPEND0_INT1     0x00000002    /* Interrupt 1 unpend */
#define NVIC_UNPEND0_INT0     0x00000001    /* Interrupt 0 unpend */

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_ACTIVE0 register. */
/* */
/****************************************************************************** */
#define NVIC_ACTIVE0_INT31    0x80000000    /* Interrupt 31 active */
#define NVIC_ACTIVE0_INT30    0x40000000    /* Interrupt 30 active */
#define NVIC_ACTIVE0_INT29    0x20000000    /* Interrupt 29 active */
#define NVIC_ACTIVE0_INT28    0x10000000    /* Interrupt 28 active */
#define NVIC_ACTIVE0_INT27    0x08000000    /* Interrupt 27 active */
#define NVIC_ACTIVE0_INT26    0x04000000    /* Interrupt 26 active */
#define NVIC_ACTIVE0_INT25    0x02000000    /* Interrupt 25 active */
#define NVIC_ACTIVE0_INT24    0x01000000    /* Interrupt 24 active */
#define NVIC_ACTIVE0_INT23    0x00800000    /* Interrupt 23 active */
#define NVIC_ACTIVE0_INT22    0x00400000    /* Interrupt 22 active */
#define NVIC_ACTIVE0_INT21    0x00200000    /* Interrupt 21 active */
#define NVIC_ACTIVE0_INT20    0x00100000    /* Interrupt 20 active */
#define NVIC_ACTIVE0_INT19    0x00080000    /* Interrupt 19 active */
#define NVIC_ACTIVE0_INT18    0x00040000    /* Interrupt 18 active */
#define NVIC_ACTIVE0_INT17    0x00020000    /* Interrupt 17 active */
#define NVIC_ACTIVE0_INT16    0x00010000    /* Interrupt 16 active */
#define NVIC_ACTIVE0_INT15    0x00008000    /* Interrupt 15 active */
#define NVIC_ACTIVE0_INT14    0x00004000    /* Interrupt 14 active */
#define NVIC_ACTIVE0_INT13    0x00002000    /* Interrupt 13 active */
#define NVIC_ACTIVE0_INT12    0x00001000    /* Interrupt 12 active */
#define NVIC_ACTIVE0_INT11    0x00000800    /* Interrupt 11 active */
#define NVIC_ACTIVE0_INT10    0x00000400    /* Interrupt 10 active */
#define NVIC_ACTIVE0_INT9     0x00000200    /* Interrupt 9 active */
#define NVIC_ACTIVE0_INT8     0x00000100    /* Interrupt 8 active */
#define NVIC_ACTIVE0_INT7     0x00000080    /* Interrupt 7 active */
#define NVIC_ACTIVE0_INT6     0x00000040    /* Interrupt 6 active */
#define NVIC_ACTIVE0_INT5     0x00000020    /* Interrupt 5 active */
#define NVIC_ACTIVE0_INT4     0x00000010    /* Interrupt 4 active */
#define NVIC_ACTIVE0_INT3     0x00000008    /* Interrupt 3 active */
#define NVIC_ACTIVE0_INT2     0x00000004    /* Interrupt 2 active */
#define NVIC_ACTIVE0_INT1     0x00000002    /* Interrupt 1 active */
#define NVIC_ACTIVE0_INT0     0x00000001    /* Interrupt 0 active */

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_PRI0 register. */
/* */
/****************************************************************************** */
#define NVIC_PRI0_INT3_M    0xFF000000      /* Interrupt 3 priority mask */
#define NVIC_PRI0_INT2_M    0x00FF0000      /* Interrupt 2 priority mask */
#define NVIC_PRI0_INT1_M    0x0000FF00      /* Interrupt 1 priority mask */
#define NVIC_PRI0_INT0_M    0x000000FF      /* Interrupt 0 priority mask */
#define NVIC_PRI0_INT3_S    24
#define NVIC_PRI0_INT2_S    16
#define NVIC_PRI0_INT1_S    8
#define NVIC_PRI0_INT0_S    0

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_PRI1 register. */
/* */
/****************************************************************************** */
#define NVIC_PRI1_INT7_M    0xFF000000      /* Interrupt 7 priority mask */
#define NVIC_PRI1_INT6_M    0x00FF0000      /* Interrupt 6 priority mask */
#define NVIC_PRI1_INT5_M    0x0000FF00      /* Interrupt 5 priority mask */
#define NVIC_PRI1_INT4_M    0x000000FF      /* Interrupt 4 priority mask */
#define NVIC_PRI1_INT7_S    24
#define NVIC_PRI1_INT6_S    16
#define NVIC_PRI1_INT5_S    8
#define NVIC_PRI1_INT4_S    0

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_PRI2 register. */
/* */
/****************************************************************************** */
#define NVIC_PRI2_INT11_M    0xFF000000     /* Interrupt 11 priority mask */
#define NVIC_PRI2_INT10_M    0x00FF0000     /* Interrupt 10 priority mask */
#define NVIC_PRI2_INT9_M     0x0000FF00     /* Interrupt 9 priority mask */
#define NVIC_PRI2_INT8_M     0x000000FF     /* Interrupt 8 priority mask */
#define NVIC_PRI2_INT11_S    24
#define NVIC_PRI2_INT10_S    16
#define NVIC_PRI2_INT9_S     8
#define NVIC_PRI2_INT8_S     0

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_PRI3 register. */
/* */
/****************************************************************************** */
#define NVIC_PRI3_INT15_M    0xFF000000     /* Interrupt 15 priority mask */
#define NVIC_PRI3_INT14_M    0x00FF0000     /* Interrupt 14 priority mask */
#define NVIC_PRI3_INT13_M    0x0000FF00     /* Interrupt 13 priority mask */
#define NVIC_PRI3_INT12_M    0x000000FF     /* Interrupt 12 priority mask */
#define NVIC_PRI3_INT15_S    24
#define NVIC_PRI3_INT14_S    16
#define NVIC_PRI3_INT13_S    8
#define NVIC_PRI3_INT12_S    0

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_PRI4 register. */
/* */
/****************************************************************************** */
#define NVIC_PRI4_INT19_M    0xFF000000     /* Interrupt 19 priority mask */
#define NVIC_PRI4_INT18_M    0x00FF0000     /* Interrupt 18 priority mask */
#define NVIC_PRI4_INT17_M    0x0000FF00     /* Interrupt 17 priority mask */
#define NVIC_PRI4_INT16_M    0x000000FF     /* Interrupt 16 priority mask */
#define NVIC_PRI4_INT19_S    24
#define NVIC_PRI4_INT18_S    16
#define NVIC_PRI4_INT17_S    8
#define NVIC_PRI4_INT16_S    0

/****************************************************************************** */
/* */
/* The following define the bit fields in the NVIC_PRI5 register. */
/* */
/****************************************************************************** */
#define NVIC_PRI5_INT23_M    0xFF000000     /* Interrupt 23 priority mask */
#define NVIC_PRI5_INT22_M    0x00FF0000     /* Interrupt 22 priority mask */
#define NVIC_PRI5_INT21_M    0x0000FF00     /* Interrupt 21 priority mask */
#define NVIC_PRI5_INT20_M    0x000000FF     /* Interrupt 20 priority mask */
#define NVIC_PRI5_INT23_S    24
#define NVIC_PRI5_INT22_S    16
#define NVIC_PRI5_INT21_S    8
#define NVIC_PRI5_INT20_S    0

